In [43]:
import numpy as np
import pandas as pd

In [44]:
s = pd.Series([1,3,5, np.nan, 6, 8])
dates = pd.date_range("20130101", periods=6)

In [45]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [46]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [47]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [48]:
from TodoDAO import TodoDAO
dao = TodoDAO('todos_db.db')
todos = dao.findAll()
df_todos = pd.DataFrame(todos)

In [49]:
df_todos.index

RangeIndex(start=0, stop=1995, step=1)

In [50]:
df_todos.columns

Index(['id', 'title', 'completed'], dtype='object')

In [51]:
df_todos['title']

0                Karlsson Brothers (BrÃ¶derna Karlsson)
1                                          Book of Love
2       Reel Bad Arabs: How Hollywood Vilifies a People
3                                              30 Beats
4                 War of the Wildcats (In Old Oklahoma)
                             ...
1990                             Blue Spring (Aoi haru)
1991                                    Sun Don t Shine
1992                                        Tribulation
1993              Xiu Xiu: The Sent-Down Girl (Tian yu)
1994                   Stuff and Dough (Marfa si banii)
Name: title, Length: 1995, dtype: object

In [52]:
df_todos.loc[1990]

id                             3996
title        Blue Spring (Aoi haru)
completed                         0
Name: 1990, dtype: object

In [53]:
df_todos.iloc[42]

id                           2046
title        Jingle All the Way 2
completed                       0
Name: 42, dtype: object

In [54]:
df_todos['title majuscule'] = df_todos["title"].map(lambda v:v.upper())
df_todos

,id,title,completed,title majuscule
0,2001,Karlsson Brothers (BrÃ¶derna Karlsson),1,KARLSSON BROTHERS (BRÃ¶DERNA KARLSSON)
1,2002,Book of Love,1,BOOK OF LOVE
2,2006,Reel Bad Arabs: How Hollywood Vilifies a People,0,REEL BAD ARABS: HOW HOLLYWOOD VILIFIES A PEOPLE
3,2007,30 Beats,0,30 BEATS
4,2008,War of the Wildcats (In Old Oklahoma),1,WAR OF THE WILDCATS (IN OLD OKLAHOMA)
...,...,...,...,...
1990,3996,Blue Spring (Aoi haru),0,BLUE SPRING (AOI HARU)
1991,3997,Sun Don t Shine,1,SUN DON T SHINE
1992,3998,Tribulation,1,TRIBULATION
1993,3999,Xiu Xiu: The Sent-Down Girl (Tian yu),0,XIU XIU: THE SENT-DOWN GIRL (TIAN YU)
1994,4000,Stuff and Dough (Marfa si banii),0,STUFF AND DOUGH (MARFA SI BANII)